app/controllers/discussions_controller.rb

SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = 1 LIMIT 1
---
  def show
	@id = params[:id].to_i
	@discussion = Discussion.find_by_id(@id)

INSERT INTO "discussions" ("created_at", "forum_id", "subject", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 21 Apr 2012 09:01:21 UTC +00:00], ["forum_id", nil], ["subject", "UC Berkeley grad school questions!! "], ["updated_at", Sat, 21 Apr 2012 09:01:21 UTC +00:00]]
---
  def create
    new_discussion = Discussion.new()
    new_discussion.subject = params[:discussion][:subject]
    if new_discussion.save

INSERT INTO "posts" ("comment", "created_at", "discussion_id", "school_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "lhelo"], ["created_at", Sat, 21 Apr 2012 10:12:09 UTC +00:00], ["discussion_id", 1], ["school_id", nil], ["updated_at", Sat, 21 Apr 2012 10:12:09 UTC +00:00], ["user_id", 1]]
---
  def create_post
	new_post = Post.new()
	new_post.comment = params[:post][:comment]
	new_post.user_id = current_user.id
	new_post.discussion_id = params[:id]
    if new_post.save